app/views/main/_post.html.erb


				<span class="comment-summary"><%= link_to(pluralize(post.approved_comments.size, 'comment'), :action => 'view_post', :id => post.id, :anchor => 'comments') %></span>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 3 AND (comments.status = 'approved')