app/controllers/main_controller.rb

  def list
  #	@posts = Post.find(:all,:include => [:author, :categories], :conditions => "status = 'published' ", :order => 'blog_posts.created_at DESC')

  @posts = Post.paginate(:include => [:author, :categories],
		   :conditions => "status = 'published'",
		  :order => 'blog_posts.created_at DESC',
		  :per_page => 5, :page => params[:page])
---
SELECT `blog_posts`.* FROM `blog_posts` WHERE (status = 'published') ORDER BY blog_posts.created_at DESC LIMIT 5 OFFSET 0
SELECT `categories`.* FROM `categories` ORDER BY name ASC

  def set_all_categories
    @all_categories = Category.find(:all, :order => 'name ASC')
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (4, 1)